In [1]:
import pandas as pd

In [2]:
df_sv = pd.DataFrame({'Name': ['John', 'Lucy', 'Lily', 'Mark', 'Tom'],
                      'Sex': ['Male', 'Female', 'Other', 'Male', 'Male'],
                       'Age': [16, 17, 16, 17, 15],})
df_sv

   Name     Sex  Age
0  John    Male   16
1  Lucy  Female   17
2  Lily   Other   16
3  Mark    Male   17
4   Tom    Male   15

In [3]:
df_sv = pd.get_dummies(df_sv, columns=['Sex'], prefix='d')
df_sv

   Name  Age  d_Male  d_Other
0  John   16       1        0
1  Lucy   17       0        0
2  Lily   16       0        1
3  Mark   17       1        0
4   Tom   15       1        0